#pragma once

// FOnline build target (passed outside)
#if !defined ( FONLINE_SERVER ) && !defined ( FONLINE_CLIENT ) && !defined ( FONLINE_EDITOR )
# error "Build target not specified"
#endif
#if ( defined ( FONLINE_SERVER ) && ( defined ( FONLINE_CLIENT ) || defined ( FONLINE_EDITOR )  ) ) || \
    ( defined ( FONLINE_CLIENT ) && ( defined ( FONLINE_SERVER ) || defined ( FONLINE_EDITOR )  ) ) || \
    ( defined ( FONLINE_EDITOR ) && ( defined ( FONLINE_SERVER ) || defined ( FONLINE_CLIENT )  ) )
# error "Multiple build targets not allowed"
#endif

// Operating system (passed outside)
// FO_WINDOWS
// FO_LINUX
// FO_MAC
// FO_IOS
// FO_ANDROID
// FO_WEB
#if !defined ( FO_WINDOWS ) && !defined ( FO_LINUX ) && !defined ( FO_MAC ) && \
    !defined ( FO_ANDROID ) && !defined ( FO_IOS ) && !defined ( FO_WEB )
# error "Unknown operating system"
#endif
#if ( defined ( FO_WINDOWS ) && ( defined ( FO_LINUX ) || defined ( FO_MAC ) || defined ( FO_ANDROID ) || defined ( FO_IOS ) || defined ( FO_WEB )  ) ) || \
    ( defined ( FO_LINUX ) && ( defined ( FO_WINDOWS ) || defined ( FO_MAC ) || defined ( FO_ANDROID ) || defined ( FO_IOS ) || defined ( FO_WEB )  ) ) || \
    ( defined ( FO_MAC ) && ( defined ( FO_LINUX ) || defined ( FO_WINDOWS ) || defined ( FO_ANDROID ) || defined ( FO_IOS ) || defined ( FO_WEB )  ) ) || \
    ( defined ( FO_ANDROID ) && ( defined ( FO_LINUX ) || defined ( FO_MAC ) || defined ( FO_WINDOWS ) || defined ( FO_IOS ) || defined ( FO_WEB )  ) ) || \
    ( defined ( FO_IOS ) && ( defined ( FO_LINUX ) || defined ( FO_MAC ) || defined ( FO_ANDROID ) || defined ( FO_WINDOWS ) || defined ( FO_WEB )  ) ) || \
    ( defined ( FO_WEB ) && ( defined ( FO_LINUX ) || defined ( FO_MAC ) || defined ( FO_ANDROID ) || defined ( FO_IOS ) || defined ( FO_WINDOWS )  ) )
# error "Multiple operating systems not allowed"
#endif

// Rendering
#if defined ( FO_IOS ) || defined ( FO_ANDROID ) || defined ( FO_WEB )
# define FO_OPENGL_ES
#endif
#if defined ( FO_WINDOWS )
# define FO_HAVE_DX
#endif

// Standard API
#include <cstdlib>
#include <cstdio>
#include <cstdarg>
#include <clocale>
#include <ctime>
#include <cmath>
#include <cstdint>
#include <memory>
#include <algorithm>
#include <functional>
#include <sstream>
#include <map>
#include <string>
#include <set>
#include <list>
#include <vector>
#include <deque>
#include <tuple>
#include <optional>
#include <typeinfo>
#include <typeindex>
#include <chrono>

#if defined ( FO_MAC ) || defined ( FO_IOS )
# include <TargetConditionals.h>
#endif

#if defined ( FO_WEB )
# include <emscripten.h>
# include <emscripten/html5.h>
#endif

#if !defined ( FO_WINDOWS )
# include <signal.h>
#endif

// String formatting
#include "fmt/format.h"

// Types
using uchar = unsigned char;
using ushort = unsigned short;
using uint = unsigned int;
using uint64 = uint64_t;
using int64 = int64_t;
using hash = uint;
using max_t = uint;

// Check the sizes of base types
static_assert( sizeof( char ) == 1 );
static_assert( sizeof( short ) == 2 );
static_assert( sizeof( int ) == 4 );
static_assert( sizeof( int64 ) == 8 );
static_assert( sizeof( uchar ) == 1 );
static_assert( sizeof( ushort ) == 2 );
static_assert( sizeof( uint ) == 4 );
static_assert( sizeof( uint64 ) == 8 );
static_assert( sizeof( bool ) == 1 );
static_assert( sizeof( void* ) >= 4 );
static_assert( sizeof( void* ) == sizeof( size_t ) );

using std::string;
using std::list;
using std::vector;
using std::map;
using std::unordered_map;
using std::multimap;
using std::set;
using std::deque;
using std::pair;
using std::tuple;
using std::istringstream;
using std::initializer_list;
using std::type_index;
using std::function;
using std::optional;

using StrUCharMap = map< string, uchar >;
using UCharStrMap = map< uchar, string >;
using StrMap = map< string, string >;
using UIntStrMap = map< uint, string >;
using StrUShortMap = map< string, ushort >;
using StrUIntMap = map< string, uint >;
using StrInt64Map = map< string, int64 >;
using StrPtrMap = map< string, void* >;
using UShortStrMap = map< ushort, string >;
using StrUIntMap = map< string, uint >;
using UIntMap = map< uint, uint >;
using IntMap = map< int, int >;
using IntFloatMap = map< int, float >;
