//      __________        ___               ______            _
//     / ____/ __ \____  / (_)___  ___     / ____/___  ____ _(_)___  ___
//    / /_  / / / / __ \/ / / __ \/ _ \   / __/ / __ \/ __ `/ / __ \/ _ \
//   / __/ / /_/ / / / / / / / / /  __/  / /___/ / / / /_/ / / / / /  __/
//  /_/    \____/_/ /_/_/_/_/ /_/\___/  /_____/_/ /_/\__, /_/_/ /_/\___/
//                                                  /____/
// FOnline Engine
// https://fonline.ru
// https://github.com/cvet/fonline
//
// MIT License
//
// Copyright (c) 2006 - present, Anton Tsvetinskiy aka cvet <cvet@tut.by>
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE

// Todo: organize class members as public, protected, private; methods, fields
// Todo: prefer this construction if(auto i = do(); i < 0) i... else i...
// Todo: improve std::to_string or fmt::format to string conversions
// Todo: casts between int types via NumericCast<to>()
// Todo: minimize platform specific API (ifdef FO_os, WinApi_Include.h...)
// Todo: clang debug builds with sanitiziers
// Todo: time ticks to uint64
// Todo: improve custom exceptions for every subsustem
// Todo: improve particle system based on SPARK engine
// Todo: research about Steam integration
// Todo: speed up content loading from server
// Todo: temporary entities, disable writing to data base

#pragma once

#ifndef PRECOMPILED_HEADER_GUARD
#define PRECOMPILED_HEADER_GUARD

// Operating system (passed outside)
// Todo: detect OS automatically not from passed constant from build system
#if FO_WINDOWS + FO_LINUX + FO_MAC + FO_ANDROID + FO_IOS + FO_WEB + FO_PS4 == 0
#error "Operating system not specified"
#endif
#if FO_WINDOWS + FO_LINUX + FO_MAC + FO_ANDROID + FO_IOS + FO_WEB + FO_PS4 != 1
#error "Multiple operating systems not allowed"
#endif

// Rendering
#if !(defined(FO_WINDOWS) && defined(WINRT))
#define FO_HAVE_OPENGL
#if defined(FO_IOS) || defined(FO_ANDROID) || defined(FO_WEB)
#define FO_OPENGL_ES
#endif
#endif
#if defined(FO_WINDOWS)
#define FO_HAVE_D3D
#endif
#if defined(FO_IOS)
// #define FO_HAVE_METAL
#endif
#if defined(FO_PS4)
#define FO_HAVE_GNM
#endif

// Standard API
#include <algorithm>
#include <array>
#include <atomic>
#include <chrono>
#include <clocale>
#include <cmath>
#include <cstdarg>
#include <cstdint>
#include <cstdio>
#include <cstdlib>
#include <ctime>
#include <deque>
#include <functional>
#include <future>
#include <list>
#include <map>
#include <memory>
#include <mutex>
#include <optional>
#include <random>
#include <set>
#include <sstream>
#include <string>
#include <thread>
#include <tuple>
#include <typeindex>
#include <typeinfo>
#include <unordered_map>
#include <unordered_set>
#include <variant>
#include <vector>

// OS specific API
#if defined(FO_MAC) || defined(FO_IOS)
#include <TargetConditionals.h>
#endif
#if defined(FO_WEB)
#include <emscripten.h>
#include <emscripten/html5.h>
#endif

// String formatting lib
#include "fmt/format.h"

// Base types
// Todo: rename uchar to uint8 and use uint8_t as alias
// Todo: rename ushort to uint16 and use uint16_t as alias
// Todo: rename uint to uint32 and use uint32_t as alias
// Todo: rename char to int8 and use int8_t as alias
// Todo: split meanings if int8 and char in code
// Todo: rename short to int16 and use int16_t as alias
// Todo: rename int to int32 and use int32_t as alias
// Todo: move from 32 bit hashes to 64 bit
using uchar = unsigned char;
using ushort = unsigned short;
using uint = unsigned int;
using uint64 = uint64_t;
using int64 = int64_t;
using hash = uint;
using max_t = uint;

// Check the sizes of base types
static_assert(sizeof(char) == 1);
static_assert(sizeof(short) == 2);
static_assert(sizeof(int) == 4);
static_assert(sizeof(int64) == 8);
static_assert(sizeof(uchar) == 1);
static_assert(sizeof(ushort) == 2);
static_assert(sizeof(uint) == 4);
static_assert(sizeof(uint64) == 8);
static_assert(sizeof(bool) == 1);
static_assert(sizeof(void*) >= 4);
static_assert(sizeof(void*) == sizeof(size_t));

// Bind to global scope frequently used types
using std::array;
using std::deque;
using std::future;
using std::initializer_list;
using std::istringstream;
using std::list;
using std::map;
using std::multimap;
using std::optional;
using std::pair;
using std::set;
using std::shared_ptr;
using std::string;
using std::tuple;
using std::type_index;
using std::type_info;
using std::unique_ptr;
using std::unordered_map;
using std::unordered_set;
using std::variant;
using std::vector;

// Math types
// Todo: replace depedency from assimp types (matrix/vector/quaternion/color)
#include "assimp/types.h"

using Vector = aiVector3D;
using VectorVec = vector<Vector>;
using Matrix = aiMatrix4x4;
using MatrixVec = vector<Matrix>;
using Quaternion = aiQuaternion;
using QuaternionVec = vector<Quaternion>;
using Color = aiColor4D;

