#include "StdAfx.h"
#include "BufMngr.h"
#include "zlib\zlib.h"

// модуль для работы с сетью
// Author: Gefke Denis [!Deniska]

#define BUF_SIZE 2048

//////////////////////////////////////////////////////////////////////////
// Внутреннии переменные модуля
extern z_stream net_zstrm;							// Структура для паковки
extern SOCKET net_sockfd;							// Присоединенный сокет
//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////
bool Output(CBufMngr & buf);						// посылка буфера
bool Input(CBufMngr & buf);							// Прием данных
bool InputCompressed(CBufMngr & buf);				// прием сжатых данных
SOCKET InitNet(void);								// Инициализация сетевого интерфейса
int Connect(char * host, WORD port);				// Коннект. host, port - адрес
void Disconnect(void);								// Дисконнект
void FinishNet(void);								// Завершение работы модуля
//SOCKET GetSocket(void) {return net_sockfd;};		// Возвращает сокет

void CheckNet(timeval tv);							// Проверка на готовность сокета
int ISSetRead(void);								// Сокет готов к чтению
int ISSetWrite(void);								// Сокет готов к записи
int ISSetExc(void);									// Произошла ли ошибка

#define NET_OK						 1				// Все ОК
#define NET_ERR_NOT_INIT			-1				// Интерфейс не инициализирован
#define NET_ERR_INVALID_ADDRESS		-2				// Неверный адрес
#define NET_ERR_SERVER_IS_DOWN		-3				// Невозможно подсоединиться к сервреу

//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////